  var profession = [
    "דוקטור!",
"מאמי!",
"נשמה!",
    "אחות!",
    "פקידת קבלה טרוטת עיניים!",
    "כפרה!",
    "משוש חיי!",
    "רמבו!",
    "מר בחור!",
    "אדוני הרופא!",
    "אח'שלי!",
    "מהראג'ה!",
    "ליסטים!"
  ];

  var ailment = [
    "כואב לי", 
    "מציק לי", 
    "מגרד לי", 
    "נעים לי",
    "מאולחש לי",
    "יש לי פריחה",
    "יש לי הפרעה אריתמית",
    "מוזר לי",
    "יש לי תחושת אכזבה",
    "יש לי גיבנת",
    "צמחה לי ציסטה",
    "יש לי עקצוץ מעורפל",
    "אני מרגיש דקירות לא ספציפיות",
    "יש לי כאב קוליקי", 
    "יש לי תחושת צריבה"
  ]

  var bodypart = [
    "בראש",
    "ברגל",
    "באפידרמיס",
    "בלשון",
    "בשחלה",
    "במפתח הלב",
    "בתריסריון",
    "בבוהן",
    "בקמיצה",
    "במרפק",
    "בהיפותלמוס",
    "בציפורן החודרנית",
    "בלחמית",
    "באשך",
    "בשן הטוחנת",
    "ברירית הרחם",
    "במיץ המרה",
    "בסוליית הנעל",
    "ברגל ימין ובפלח ישבן שמאל",
    "בכפף הטחול",
    "בבלוטת החשק",
 "באצבע ימין ובציפורן אצבע 3 ברגל שמאל",
 "עמוק בתוך הראש וגם במרפק",
 "בחזה ומקרין לירך ימין",
      "בעין ימין ובכתף ימין",
      "במקום הזה שפעם שר",      
        "ליד עצם הזנב",
           "במקומות מוצנעים",
      "בליגמנט על שם טרייץ",
      "בדוגלס פאוצ'",
      "בפפילה על שם וואטר",
       "באוזן התיכונה מימין",
       "ביותרת האשך אבל יותר משמאל",  
       "ברביע ימני תחתון",
        "ליד עצם הזנב",
  ]

  var duration1 = [
    "מזה 20 דקות",
    "מאתמול בערב",
      "מהיום בבוקר",
    "משלשום בצהריים",
    "מלפני החגים",
    "מאמצע שבוע שעבר",
    "משש וחצי בבוקר",
   "מזה 5, רגע! 7 שניות",
   "כבר שבועיים",
   "מזה מילניום וחצי",
   "מזה 5 דקות בדיוק",
   "מזה עשור",
   "מאז פסח שני",
    "מזה חודש",
    "כבר ארבעים שנה",
    "מזה לילה",
    "מאז שאני זוכרת את עצמי",
    "מאז שהירח היה בבית השביעי וצדק התיישר עם מאדים",
    "כבר כמעט מהצהריים",
    "הרבה יותר מדי זמן",
    "מאז התקרית",
    "משלהי האביב",
    "מאז הסרט האחרון של פליני",
    "מאז הדיסק האחרון של נירוונה",
    "מאז שקראתי את יוליסס",
    "מהרגע שיצאה העונה האחרונה של משחקי הכס",
    "מתקופת שושלת מינג",
    "מזה 4 שבועות ושעה",
    "מזה 6 שעות",
    "מבוקר יום קבלתי",
  ];

  var also = [
    "וגם ",
    "וכמו כן ",
    "וחוצמזה ",
    "ובנוסף לכך ",
    "ואם זה לא מספיק אז ",
    "וזה עוד כלום!  ",
  ]

  var furthermore = [
    "אני סובל מ",
    "אני מתענה מ",
    "יש לי ",
    "הבחנתי ב",
    "אני סובל לפרקים מ",
  ]

  var and = [
      "כאבים בשלפוחית השתן",
      "פריחה אדמדמה",
      "כאב ראש טורדני",
"שלשול עמיד",
      "חום",
      "שיעול פרודקטיבי",
      "קופסה מלאה בגיריות",
      "חברים מעצבנים",
      "דימום פנימי",
      "רשרוש בלב",
            "כאבים עזים בשלפוחית השתן",
      "פריחה אריתמטוטית נעלמת בלחיצה",
      "פריחה מקולו-פפולרית",
      "כאב ראש טורדני",
"ארתריטיס מיגרטורית",
"שלשול עמיד",
"אכטימה גנגרנוזום",
      "חום וצמרמורות",
      "בצקת פטמות",
      "סימני DVT שאיבחנתי בעצמי,",
      "כפל ראיה",
      "דם בשתן ודיסאוריה",
      "הקאות קשתיות",
      "אקסית שגורמת לי לכתוב מחוללי תגובות במקום לעבוד",
 
      ];
    
      var diagnosis = [
      "אני ממש עייפה",
      "זאבת (זאת אף פעם לא זאבת)",
      "דבר שחור",
      "אנשים זה דרעק",
      "חום",
      "עוד קפה בשבילי",
            "אני ממש עייפה",
      "לופוס",
      "דבר",
      "רוח מין הון!",
      "להמשך בירור בקהילה",
      "גימליטיס פולמיננטית",
      "ביטוחיטיס חריפה",
      "אקיוט און כרוניק דמנציה",
      "באק טו הרצוג!",
      "לא ברור אבל נתחיל סטרואידים",
      "סיביר צפטריאקסון דפישנסי",
      "עוד קפה בשבילי",
      "חומר למצגת לישיבת מחלקה",
            ];


function getHurts() {
  return hurts[Math.floor(Math.random()*hurts.length)].replace("BP", randomBodyPart());
}


//I was handed a poorly written code and was too lazy to refactor it, don't judge me!
function reload() {        
  var LR1 = Math.floor(Math.random()*profession.length);
  var LR2 = Math.floor(Math.random()*ailment.length);
  var LR22 = Math.floor(Math.random()*bodypart.length);
  var LR3 = Math.floor(Math.random()*duration1.length);
  var LR33 = Math.floor(Math.random()*also.length);
  var LR333 = Math.floor(Math.random()* furthermore.length);
  var LR4 = Math.floor(Math.random()*and.length);
  var LR5 = Math.floor(Math.random()*duration1.length);
  while (LR5 == LR3) {
      var LR5 = Math.floor(Math.random()*duration1.length);
  }
  var LR6 = Math.floor(Math.random()*diagnosis.length);


var rText = profession[LR1] + " " 
        + ailment[LR2] + " " 
        + bodypart[LR22] + " " 
        + duration1[LR3] + " " 
        + also[LR33] + furthermore[LR333] 
        + and[LR4] + " " + duration1[LR5] 
        + ".<br/> <br/> (באבחנה מבדלת: " + diagnosis[LR6] +")";

 document.getElementById("complaint").innerHTML = rText;
    }
    window.addEventListener("load",reload);