  var profession = [
    "דוקטור!",
"מאמי!",
"נשמה!",
    "אחות!",
    "פקידת קבלה טרוטת עיניים!",
    "כפרה!",
    "משוש חיי!",
    "רמבו!",
    "מר בחור!",
    "אדוני הרופא!",
    "אח'שלי!",
    "מהראג'ה!",
    "ליסטים!"
  ];

  var ailment = [
    "כואב לי", 
    "מציק לי", 
    "מגרד לי", 
    "נעים לי",
    "מאולחש לי",
    "יש לי פריחה לא ספציפית",
    "יש לי הפרעת קצב",
    "מוזר לי",
    "מדגדג לי",
    "יש לי תחושת אכזבה",
    "אני חש סחרחורת",
    "יש לי גיבנת",
    "יש לי צ'יסטה",
    "יש לי עקצוץ",
    "אני חש דקירות לא ספציפיות",
    "יש לי כאב קוליקי", 
"יש לי גבשוש",
"יש לי אבצס",
    "יש לי תחושת צריבה"
"יש לי תחושת לחץ",
"יש לי אוטם חריף",
"אני סובל מאוטם המורגי",
"יש לי קריש חוסם",
"יש לי אי ספיקה דיאסטולית",
"יש לי אי ספיקה סיסטולית",
"יש לי בצקת גומתית",
"יש לי תפליטים",
"יש לי נגע נקרוטי",

  ]

  var bodypart = [
    "בראש",
    "ברגל",
    "באפידרמיס",
    "בזקיק השערה",
    "בלשון",
    "בשחלה",
    "במפתח הלב",
    "בבצל התריסריון",
    "בבוהן",
    "בקמיצה",
    "במרפק",
    "בהיפותלמוס",
    "בציפורן הקטנה",
    "בקולון העולה",
    "בסיגמואיד",
    "בלחמית",
    "באשך",
    "בשן הטוחנת",
    "ברירית הרחם",
    "בדרכי המרה",
    "בטיביה הפרוקסימלית",
    "במפרק הירך",
    "ברגל ימין ובפלח ישבן שמאל",
    "בכפף הטחול",
    "בבלוטת החשק",
 "באצבע ימין ובציפורן אצבע 3 ברגל שמאל",
 "עמוק בתוך הראש וגם במרפק",
 "בחזה ומקרין לירך ימין",
"בחזה שמאל",
      "בעין ימין ובכתף ימין",
      "באונה עליונה של ריאה ימין",
      "ממש על מיתרי הקול",      
        "ליד עצם הזנב",
           "במקומות מוצנעים",
      "בליגמנט על שם טרייץ",
      "בדוגלס פאוצ'",
      "בפפילה על שם וואטר",
       "באוזן התיכונה מימין",
       "ביותרת האשך אבל יותר משמאל",  
       "ברביע ימני תחתון",
        "ליד עצם הזנב",
        "באבובית המקורבת",
        "בלולאה על שם הנלה",
        "בגרעיני הבסיס",
        "בשקדים",
        "בסינוס האתמואידלי",
        "בגב התחתון",
        "באגן הכליה",
        "בפרנכימת הכבד",
        "באקוודוקט על שם סילביוס",
  ]

  var duration1 = [
    "מזה 20 דקות",
    "מאתמול בערב",
      "מהיום בבוקר",
    "מיום קבלתי",
    "משלשום בצהריים",
    "מלפני החגים",
    "מאמצע שבוע שעבר",
    "משש וחצי בבוקר",
   "מזה 5, רגע! 6 שניות",
   "כבר שבועיים",
   "מזה מילניום וחצי",
   "מזה 5 דקות בדיוק",
   "מזה עשור",
   "מאז פסח שני",
    "מזה חודש",
    "כבר ארבעים שנה",
    "מליל אמש",
    "מאז שאכלתי סמבוסק",
    "מאז שגיליתי את ממים של רופאים",
    "מזה לילה",
    "מאז שאני זוכרת את עצמי",
    "מאז שהירח היה בבית השביעי וצדק התיישר עם מאדים",
    "כבר כמעט מהצהריים",
    "מאז שעזבתי את הר הצופים",
    "מזה חמש שנים",
    "מאז מלחמת יום כיפור",
    "מזה יומיים",
    "משנתיים טרם קבלתי",
    "מאז שחרורי מאשפוז רצנטי",
    "מזה יומיים מאז פנייתי האחרונה למיון",
    "הרבה יותר מדי זמן",
    "מאז התקרית",
    "משלהי האביב",
    "מאז הסרט האחרון של פליני",
    "מאז הדיסק האחרון של נירוונה",
    "מאז שקראתי את יוליסס",
    "מהרגע שיצאה העונה האחרונה של משחקי הכס",
    "מתקופת שושלת מינג",
    "מזה 4 שבועות ושעה",
    "מזה 6 שעות",
    "מבוקר יום קבלתי",
     "מאז ארוחת הבוקר",
    "מאז שהייתי צריך לחזור לבסיס",
    "מזה 3 ימים בדיוק",
    "מזה 5 שעות",
   "מזה יממה",
   "מאז שהתעוררתי",
   "מזה 49 שעות",
 "לסירוגין",
  ];

  var also = [
    "וגם ",
    "וכמו כן ",
    "וחוצמזה ",
    "ובנוסף לכך ",
    "ואם זה לא מספיק אז ",
    "וזה עוד כלום!  ",
  ]

  var furthermore = [
    "אני סובל מ",
    "אני מתענה מ",
    "אני נמק מ",
    "אבחנתי את עצמי עם",
   "קראתי בוואינט שיש לי",
    "אמרו לי בפייסבוק שאני סובל מ",
  "הנטורופתית שלי איבחנה לי",
    "יש לי ",
    "הבחנתי ב",
    "אני סובל לפרקים מ",
  ]

  var and = [
      "כאבים בשלפוחית השתן",
      "פריחה פטכיאלית",
      "כאב ראש טורדני",
   "עצירות",
  "יציאות רכות",
      "קשיון עורף",
"שלשול עמיד",
      "חום",
      "שיעול פרודקטיבי",
      "קופסה מלאה בגיריות",
      "חברים מעצבנים",
      "דימום פנימי",
      "SIRS",
      "רשרוש בלב",
            "כאבים עזים בשלפוחית השתן",
      "פריחה אריתמטוטית נעלמת בלחיצה",
      "פריחה מקולו-פפולרית",
      "מדדי דלקת מוחשים",
     "פריחה וזיקולרית",
      "כאב ראש טורדני",
"ארתריטיס מיגרטורית",
"שלשול עמיד",
"אכטימה גנגרנוזום",
"אריתמה נודוזום",
"ציור ורידי מוגבר",
      "חום וצמרמורות",
 "ציפורן חודרנית",
      "בצקת פטמות",
      "סימני DVT שאיבחנתי בעצמי,",
      "כפל ראיה",
      "אבדן בוחן מציאות",
     "הלוצינציות אודיטוריות",
     "חשק עז להטריד מינית סטאז'רית",
     "תשוקה בלתי נשלטת לכפכף סטאז'ר",
     "סטיגמטה של אנדוקרדיטיס",
      "דם בשתן ודיסאוריה",
      "הקאות בקשת",
     "נוירופתיה פריפרית",
     "דפיקות לב",
     "FTT ",
      "אקסית שגורמת לי לכתוב מחוללי תגובות במקום לעבוד",
 
      ];
    
      var diagnosis = [
      "אני ממש עייפה",
      "קאלה אזאר",
     "ריקארנט פרסונליטיס",
      "אנשים זה דרעק",
      "זו בוודאי שאלה משוחזרת",
      "עוד קפה בשבילי",
      "לופוס",
      "וריאנט תקין",
      "טעות מעבדה",
      "רוח מין הון!",
      "להמשך בירור בקהילה",
      "גימליטיס פולמיננטית",
      "ביטוחיטיס חריפה",
      "אקיוט און כרוניק דמנציה",
      "באק טו הרצוג!",
      "לא ברור אבל נתחיל סטרואידים",
      "סיביר צפטריאקסון דפישנסי",
      "קייס ריפורט",
      "חומר למצגת לישיבת מחלקה",
"התקף חרדה. של הרופא",
"החקיין הגדול",
"הרוצח השקט",
"זיהום ויראלי שיחלוף מעצמו",
"מיטלשמערץ",
            ];


function getHurts() {
  return hurts[Math.floor(Math.random()*hurts.length)].replace("BP", randomBodyPart());
}


//I was handed a poorly written code and was too lazy to refactor it, don't judge me!
function reload() {        
  var LR1 = Math.floor(Math.random()*profession.length);
  var LR2 = Math.floor(Math.random()*ailment.length);
  var LR22 = Math.floor(Math.random()*bodypart.length);
  var LR3 = Math.floor(Math.random()*duration1.length);
  var LR33 = Math.floor(Math.random()*also.length);
  var LR333 = Math.floor(Math.random()* furthermore.length);
  var LR4 = Math.floor(Math.random()*and.length);
  var LR5 = Math.floor(Math.random()*duration1.length);
  while (LR5 == LR3) {
      var LR5 = Math.floor(Math.random()*duration1.length);
  }
  var LR6 = Math.floor(Math.random()*diagnosis.length);


var rText = profession[LR1] + " " 
        + ailment[LR2] + " " 
        + bodypart[LR22] + " " 
        + duration1[LR3] + " " 
        + also[LR33] + furthermore[LR333] 
        + and[LR4] + " " + duration1[LR5] 
        + ".<br/> <br/> (באבחנה מבדלת: " + diagnosis[LR6] +")";

 document.getElementById("complaint").innerHTML = rText;
    }
    window.addEventListener("load",reload);
