var pristine = true;

function mouseOverButton() {
  if (localStorage.getItem('complains_counter') == 1) {
    document.getElementById("reload").innerHTML = "&lt;spacebar&gt;";
  }
}

document.body.onkeydown = function (e) {
  if (e.keyCode == 32) {
    document.getElementById("reload").style.color = "Darkred";
  }
}

document.body.onkeyup = function (e) {
  if (e.keyCode == 32) {
    document.getElementById("reload").style.color = "black";
    reload()
  }
}

function ailment() {
  return (Math.random() < (simpAilment.length) / (simpAilment.length + compAilment2.length))
    ? re(simpAilment) : re(compAilment1) + re(compAilment2)
}

function re(list) {
  return list[Math.floor(Math.random() * list.length)]
}

function reload() {

  function rText(d1, d2) {
    return "<div class=\"small\" id=\"num\">תלונה מספר <a id=\"counter\"></a></div>" +
      re(profession) + re(exclamation) + " " + ailment() + " " + re(bodypart) + " "
      + d1 + " " + re(also) + re(furthermore) + re(and) + " " + d2
      + ".<br/> <br/> <div class=\"small\"> (באבחנה מבדלת: " + re(diagnosis) + ")</div>";
  }

  d1 = re(duration1);
  do { d2 = re(duration1) } while (d2 == d1);
  document.getElementById("complaint").innerHTML = rText(d1, d2);

  var n = localStorage.getItem('complains_counter');

  if (n == 1) {
    document.getElementById("reload").innerHTML = "עוד תלונה מוצדקת";
  }

  if (n === null) n = 0;
  n++;
  localStorage.setItem("complains_counter", n);

  document.getElementById("counter").innerHTML = n;
}

window.addEventListener("load", reload);

var profession = [
  "דוקטור",
  "מאמי",
  "נשמה",
  "אחות",
  "פקידת קבלה טרוטת עיניים",
  "כפרה",
  "משוש חיי",
  "רמבו",
  "מר בחור",
  "אדוני הרופא",
  "אח'שלי",
  "מהראג'ה",
  "גיבור",
  "מלך",
  "אלוף",
  "תותח",
  "זיין",
  "ליסטים",
  "אחינו הנהג",
];

var exclamation = [
  "!", "!!", "!!!", "!?!", "?!?", "...", "!?", "?!", "???"
]

var simpAilment = [
  "כואב לי",
  "מציק לי",
  "מגרד לי",
  "נעים לי",
  "מאולחש לי",
  "ממש קר לי",
  "מוזר לי",
  "מדגדג לי",
]

var compAilment1 = [
  "יש לי ",
  "אבחנתי בעצמי ",
  "שמתי לב ל",
  "אני חש ",
]

var compAilment2 = [
  "פריחה לא ספציפית",
  "הפרעת קצב",
  "תחושת אכזבה",
  "סחרחורת",
  "גיבנת",
  "ציסטה",
  "עקצוץ",
  "דקירות לא ספציפיות",
  "כאב קוליקי",
  "גבשוש",
  "אבצס",
  "תחושת צריבה",
  "תחושת לחץ",
  "אוטם חריף",
  "אוטם המורגי",
  "קריש חוסם",
  "אי ספיקה דיאסטולית",
  "אי ספיקה סיסטולית",
  "בצקת גומתית",
  "תפליטים",
  "נגע נקרוטי",
  "תולעת סרט",
  "קדחת השחת",
  "קרצינומה",
  "קנדידה",
  "גורגונדולוזה",
  "מוצרלה",
]

var bodypart = [
  "בראש",
  "ברגל",
  "באפידרמיס",
  "בזקיק השערה",
  "בלשון",
  "בשחלה",
  "במפתח הלב",
  "בבצל התריסריון",
  "בבוהן",
  "בקמיצה",
  "במרפק",
  "בהיפותלמוס",
  "בציפורן הקטנה",
  "בקולון העולה",
  "בסיגמואיד",
  "בלחמית",
  "באשך",
  "בשן הטוחנת",
  "ברירית הרחם",
  "בדרכי המרה",
  "בטיביה הפרוקסימלית",
  "במפרק הירך",
  "בגיד אכילס",
  "ברגל ימין ובפלח ישבן שמאל",
  "בכפף הטחול",
  "בבלוטת החשק",
  "באצבע ימין ובציפורן אצבע 3 ברגל שמאל",
  "עמוק בתוך הראש וגם במרפק",
  "בחזה ומקרין לירך ימין",
  "בחזה שמאל",
  "בעין ימין ובכתף ימין",
  "באונה עליונה של ריאה ימין",
  "ממש על מיתרי הקול",
  "ליד עצם הזנב",
  "במקומות מוצנעים",
  "בליגמנט על שם טרייץ",
  "בדוגלס פאוצ'",
  "בפפילה על שם וואטר",
  "באוזן התיכונה מימין",
  "ביותרת האשך (אבל יותר משמאל)",
  "ברביע ימני תחתון",
  "ליד עצם הזנב",
  "באבובית המקורבת",
  "באיי לנגרהנס",
  "בלולאה על שם הנלה",
  "בגרעיני הבסיס",
  "בשקדים",
  "בסינוס האתמואידלי",
  "בגב התחתון",
  "באגן הכליה",
  "בפרנכימת הכבד",
  "באקוודוקט על שם סילביוס",
]

var duration1 = [
  "מזה 20 דקות",
  "מאתמול בערב",
  "מהיום בבוקר",
  "מיום קבלתי",
  "משלשום בצהריים",
  "מלפני החגים",
  "מאמצע שבוע שעבר",
  "משש וחצי בבוקר",
  "מזה 5, רגע! 6 שניות",
  "כבר שבועיים",
  "מזה מילניום וחצי",
  "מזה 5 דקות בדיוק",
  "מזה עשור",
  "מאז פסח שני",
  "מזה חודש",
  "כבר ארבעים שנה",
  "מליל אמש",
  "מאז שאכלתי סמבוסק",
  "מאז שגיליתי את ממים של רופאים",
  "מזה לילה",
  "מאז שאני זוכרת את עצמי",
  "מאז שהירח היה בבית השביעי וצדק התיישר עם מאדים",
  "כבר כמעט מהצהריים",
  "מאז שעזבתי את הר הצופים",
  "מזה חמש שנים",
  "מאז מלחמת יום כיפור",
  "מזה יומיים",
  "משנתיים טרם קבלתי",
  "מאז שחרורי מאשפוז רצנטי",
  "מזה יומיים מאז פנייתי האחרונה למיון",
  "הרבה יותר מדי זמן",
  "מאז התקרית",
  "משלהי האביב",
  "מאז הסרט האחרון של פליני",
  "מאז הדיסק האחרון של נירוונה",
  "מאז שקראתי את יוליסס",
  "מהרגע שיצאה העונה האחרונה של משחקי הכס",
  "מתקופת שושלת מינג",
  "מזה 4 שבועות ושעה",
  "מזה 6 שעות",
  "מבוקר יום קבלתי",
  "מאז ארוחת הבוקר",
  "מאז שהייתי צריך לחזור לבסיס",
  "מזה 3 ימים בדיוק",
  "מזה 5 שעות",
  "מזה יממה",
  "מאז שהתעוררתי",
  "מזה 49 שעות",
  "לסירוגין",
];

var also = [
  "וגם ",
  "וכמו כן ",
  "וחוצמזה ",
  "ובנוסף לכך ",
  "ואם זה לא מספיק אז ",
  "וזה עוד כלום! ",
]

var furthermore = [
  "אני סובל מ",
  "אני מתענה מ",
  "אני נמק מ",
  "אני קומל מ",
  "אבחנתי את עצמי עם ",
  "קראתי בוואינט בריאות שיש לי ",
  "לפי מה שאיתי גל פרסם יש לי ",
  "קראתי בהורוסקופ שאני סובל מ",
  "מוחכוורת רפואה אמר שיש לי ",
  "שמעתי אלבום של לד זפלין מהסוף להתחלה והיה שם קול שטני שהדביק אותי ב",
  "אכלתי בשר ודג מאותה הצלחת וזה גרם לי ל",
  "שיחקתי עם ילד לא מחוסן ונדבקתי ב",
  "ננשכתי על ידי איש זאב והוא הדביק אותי ב",
  "אמרו לי בפייסבוק שאני סובל מ",
  "הנטורופטית שלי אבחנה לי ",
  "יש לי ",
  "הבחנתי ב",
  "אני סובל לפרקים מ",
]

var and = [
  "כאבים בשלפוחית השתן",
  "פריחה פטכיאלית",
  "כאב ראש טורדני",
  "עצירות",
  "יציאות רכות",
  "יציאות קשות",
  "יציאות ככה ככה",
  "יציאות עם תירס אפילו שלא אכלתי תירס",
  "קשיון עורף",
  "שלשול עמיד",
  "חום",
  "שיעול פרודקטיבי",
  "קופסה מלאה בגיריות",
  "חברים מעצבנים",
  "דימום פנימי",
  "SIRS",
  "רשרוש בלב",
  "כאבים עזים בשלפוחית השתן",
  "פריחה אריתמטוטית נעלמת בלחיצה",
  "פריחה מקולו-פפולרית",
  "מדדי דלקת מוחשים",
  "פריחה וזיקולרית",
  "כאב ראש טורדני",
  "ארתריטיס מיגרטורית",
  "אכטימה גנגרנוזום",
  "אריתמה נודוזום",
  "ציור ורידי מוגבר",
  "חום וצמרמורות",
  "ציפורן חודרנית",
  "בצקת פטמות",
  "סימני DVT שאיבחנתי בעצמי",
  "כפל ראיה",
  "אבדן בוחן מציאות",
  "הלוצינציות אודיטוריות",
  "חשק עז להטריד מינית סטאז'רית",
  "תשוקה בלתי נשלטת לכפכף סטאז'ר",
  "סטיגמטה של אנדוקרדיטיס",
  "דם בשתן ודיסאוריה",
  "הקאות בקשת",
  "נוירופתיה פריפרית",
  "דפיקות לב",
  "FTT",
  "אקסית שגורמת לי לכתוב מחוללי תגובות במקום לעבוד",

];

var diagnosis = [
  "אני ממש עייפה",
  "קאלה אזאר",
  "ריקארנט פרסונליטיס",
  "אנשים זה דרעק",
  "זו בוודאי שאלה משוחזרת",
  "עוד קפה בשבילי",
  "לופוס",
  "וריאנט תקין",
  "טעות מעבדה",
  "רוח מין הון!",
  "להמשך בירור בקהילה",
  "גימליטיס פולמיננטית",
  "ביטוחיטיס חריפה",
  "אקיוט און כרוניק דמנציה",
  "באק טו הרצוג!",
  "לא ברור אבל נתחיל סטרואידים",
  "סיביר צפטריאקסון דפישנסי",
  "קייס ריפורט",
  "חומר למצגת לישיבת מחלקה",
  "התקף חרדה. של הרופא",
  "החקיין הגדול",
  "הרוצח השקט",
  "זיהום ויראלי שיחלוף מעצמו",
  "מיטלשמערץ",
  "סטרפטוקוקוס",
  "אנחנו צריכים להתייחס יותר בכבוד לשואבי האבק שלנו",
  "רקוויאם לחלום זה הסרט הכי אובר רייטד בעולם",
  "בז', אני אצבע את התקרה בבז'",
  "הפסקתי להקשיב באמצע המשפט הראשון כי לא ישנתי כבר 36 שעות",
  "שלושה כוכבי מישלן",
  "P!=NP",
  "ואלאר מרגוליס",
];
